[{
  "Event_id": 1,
  "Event_name": "Debug Me",
  "Event_type": "IT",
  "Start_time": "1:00PM",
  "End_time": "5:00PM",
  "Date": "18/12/2025",
  "Description": "A debugging challenge where participants must identify and fix bugs in pre-written code. It tests logical thinking, code comprehension, and attention to detail. Participants are judged on speed and accuracy.",
  "How_it_works": "1.Run Diagnostics. 2.Checks API connections (ticketing, weather, map, etc.). 3.Tests data retrieval and display. 4.Error Identification. 5.Highlights broken API calls or incorrect parameters.6.Flags missing or invalid event data. 7.Fix Suggestions 8.Offers troubleshooting tips or automated corrections.",
  "Skills_developed": "1.Debugging and diagnostic thinking. 2.Reading and interpreting unfamiliar code. 3.Syntax and logic correction. 4.Patience, precision, and focus.",
  "GamePlay": "1.Receive the Buggy Code. 2.Each participant/team gets the same code problem set. 3.Identify Bugs.4.Look for syntax errors, logical errors, and integration issues.5.Fix the Code.6.Apply corrections so the code runs as intended.7.Test the Solution.8.Run the program (or submit the fix) to confirm the bug is resolved.",
  "How_to_play": "Compeleter can participant either solo player or 2 - 3 people. Participants have only 15-45 minutes for challenge. We have provide pre-written buggy code snippets in a specific programming language (or multiple languages).Bug report sheet or scoring system.Run the code. Judges give marks based on challenge.",
  "Rules_regulations": "Participants must identify and fix bugs in the provided code within the given time limit. Points are awarded for each correct fix.Participants must have basic coding knowledge in the chosen language(s).All participants work on the same set of buggy code.Code may contain syntax errors, logic errors, and integration issues (including broken API calls).Fixes must not break any other part of the program.Use of the internet for syntax references is allowed, but copying complete solutions is not.All solutions must be submitted before the timer ends.Game of total score is 50. +30 point is for fixing a major bug. +15 point for fixing minor bug. +5 point for adding valid optimization. -10 point is for not completing the challenge. If participant use AI tools or outside help to submit pre-made complete fixes, Editing code outside the provided environment or Submitting after the time limit, that player will be disqualified. Judge's decision will be last.",
  "photo_path": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755005056/ccioit4bkach611yfx7w.png",
  "Name": "Dhruti Shash",
  "Designation": "Flutter Developer",
  "event_image1": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451288/w9nnzcpvjh5kh9frh8yv.png",
  "event_image2": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451284/cnfnw6ktzjxie0ph115s.webp",
  "Location": "Chaprabhatha"
},
{
  "Event_id": 2,
  "Event_name": "API Mashup",
  "Event_type": "IT",
  "Start_time": "1:00PM",
  "End_time": "5:00PM",
  "Date": "18/12/2025",
  "Description": "Unleash your creativity in API Mashup, where innovation meets integration. Participants must build a cool, functional mini-project by combining two or more public APIs. Whether you're building a weather-powered playlist app or a meme generator that reacts to news headlines, the only limit is your imagination.",
  "How_it_works": "1.Collect Data from Multiple APIs.2.Combine and Display Information.3.Enable Actions",
  "Skills_developed": "1.RESTful API integration.2.Front-end/back-end rapid prototyping.3.Handling JSON data, asynchronous requests.4.Creativity and project planning.",
  "GamePlay": "1.Pick the APIs.2.Teams must select at least two different APIs from the provided list.3.Brainstorm the Mashup Idea.4.Identify how the chosen APIs can work together to solve the event challenge.5.Design or Prototype.6.Either sketch out the concept (wireframes, diagrams) or build a working demo.7.Prepare a Short Pitch. Some think you need to include 1.The problem you’re solving.2.Which APIs you used.3.How they interact.4.The benefit to the event or attendees",
  "How_to_play": "Completer can participant either solo player or 2 - 3 people. Participants have only 30 minutes to 2 hours for challenge. We have provide A curated list of APIs (e.g., maps, weather, ticketing, social media, payment gateways).Theme or problem statement related to the event (e.g., “Make the attendee experience smoother”).Run the code. judges give marks base on challenge.",
  "Rules_regulations": "1.Organizers will provide a curated API Pool (documented endpoints, example keys, and rate limits).2.Each team must use at least two different APIs from the pool. 3.Third-party APIs not in the pool may be used only if pre-approved by organizers.4.Teams may submit either:[A concept + mockups/wireframes explaining API interactions, or A working prototype/demo that shows actual API integration].5.Teams must disclose which APIs they used and any third-party libraries in their submission.6.All work must be done within the event timeframe; saving work to external servers is allowed only if documented and permitted by organizers.7.Teams may reuse public libraries and SDKs but must not copy full solutions from previous projects or external sources.Creativity & Originality — 30% (novel usage of APIs),Feasibility & Impact — 25% (solves a clear problem, real-world utility),Technical Integration — 25% (correct, secure use of APIs; error handling; meaningful data flow),Presentation & UX — 20% (clarity of pitch, mockups/prototype polish).Participants who join event will disqualify if they use  paid API keys not provided or pre-approved by organizers without permission or plagiarism or copying another team’s submission or submitting after the deadline without organizer approval or exposing private credentials or sensitive participant data in public submissions",
  "photo_path": "https://demo.bravisthemes.com/festiva/wp-content/uploads/2024/08/about-us-author-6.jpg",
  "Name": "Mark Antony",
  "Designation": "Full-stack developer",
  "event_image1": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451288/tk9sodsbqhvwvwjteb99.png",
  "event_image2": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451283/u5skmnmhxvsbc916agao.webp",
  "Location": "Chaprabhatha"
},{
  "Event_id": 3,
  "Event_name": "Design Desh",
  "Event_type": "IT",
  "Start_time": "1:00PM",
  "End_time": "5:00PM",
  "Date": "18/12/2025",
  "Description": "Design Dash is a fast-paced UX/UI challenge that focuses on product thinking and human-centered design. Participants are given a prompt, such as “Design a mobile app to help students manage stress,” and must sketch or prototype a user-friendly interface within a limited time.Using tools like Figma, Adobe XD, Sketch, or even pen and paper, competitors work individually or in small teams to wireframe an app or feature that prioritizes user experience. This is not a coding challenge — it's about how well you understand user behavior and solve problems through interface and interaction design.",
  "How_it_works": "1.Quick Start Templates – Pre-made event layouts (e.g., schedule page, speaker profile, map view).2.Drag-and-Drop Editing – Instantly rearrange UI components such as agenda blocks, ticketing widgets, and API-driven content feeds.3.Live Preview – See design changes reflected in real time with connected API data.4.Time Challenge Mode (optional) – Complete a design in a set timeframe for training or gamification.",
  "Skills_developed": "1.Wireframing and prototyping.2.Design thinking and user journey mapping.3.Empathy-driven problem-solving.4.Visual storytelling.",
  "GamePlay": "1.Receive the Design Brief.2.Includes the challenge, required elements, and target audience.3.Plan Quickly.4.Decide on the layout, color scheme, and content placement.5.Build the Design.6.Create a wireframe, mockup, or clickable prototype.7.Submit Your Work.8.Present to judges or upload for audience voting.",
  "How_to_play": "Completer can participant either solo player or 2 - 3 people. Participants have only 30 minutes to 1 hours for challenge. We have provide a design brief with theme and requirements (e.g., “Redesign the event schedule page”).Access to design tools (Figma, Canva, Adobe XD, etc.) or physical materials (sketchpads, markers).Brand assets like event logos, color palettes, and fonts. judges give marks base on challenge.",
  "Rules_regulations": "1.Organizers will provide a design brief containing.2.The theme (e.g., “Redesign the event schedule page”).3.Required elements (logos, branding, specific features).4.Target audience details.5.All designs must be created within the official time limit using approved tools (Figma, Adobe XD, Canva, Sketch, or physical materials like sketchpads).6.Participants must use the provided brand assets (colors, fonts, logos).7.All work must be original and created during the event.8.Stock images and icons may be used only if license-free or approved by organizers.9.Designs should focus on user experience (UX) as well as visual creativity.Typically 30–60 minutes per round (organizers may adjust).A final design file or exported images/screenshots. A short (2–3 minute) explanation of design choices for judges.Creativity & Originality — +20 point ,Usability & UX Flow — +10 point,Brand Consistency — +10 point,Presentation & Clarity — +10 point",
  "photo_path": "https://demo.bravisthemes.com/festiva/wp-content/uploads/2024/08/about-us-author-4.jpg",
    "Name": "Shrey Chauhan",
  "Designation": "Frontend develope",
  "event_image1":"https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451288/snvjjej4ejqjsxvltvvg.png",
  "event_image2": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451285/lcoobocg511wob0gtawe.png",
  "Location": "Chaprabhatha"
},
{
  "Event_id": 4,
  "Event_name": "AI battle",
  "Event_type": "IT",
  "Start_time": "1:00PM",
  "End_time": "5:00PM",
  "Date": "19/12/2025",
  "Description": " AI Battle is typically a competitive scenario where two or more artificial intelligence systems are pitted against each other to solve tasks, play games, or outperform each other in specific challenges. If we place it in your event-tech / project context, it could be designed as an interactive event activity where different AI models, bots, or algorithms compete in real-time, often with human participants watching or influencing the outcome.",
  "How_it_works":"1.Define the Challenge(Could be text generation, image creation, code debugging, game playing, or real-time decision-making).2.Load AI Competitors(Example:ChatGPT vs. Claude in a quiz challenge, or two vision models competing in image recognition).3.Real-Time Output Display( Audience or judges see AI responses live).4.Scoring & Winner Selection(Based on speed, accuracy, creativity, or audience votes.)",
  "Skills_developed": "1.Algorithmic thinking.2.Game logic and simulation.3.Decision trees, heuristics, basic AI.4.Competitive strategy and coding under pressure.",
  "GamePlay": "1.Challenge Announcement.2.Organizers reveal the task (e.g., “Generate the funniest event welcome message”).3.AI Execution.4.Each team prompts their AI model to complete the task.5.Show the Output.6.Results are displayed live for the audience/judges.7.Scoring.8.Points awarded based on creativity, accuracy, and entertainment value.",
  "How_to_play": "Completer can participant either solo player or 2 - 3 people. Participants have 15–45 minutes per round . A set of predefined challenges (e.g., code generation, image creation, trivia answering).Access to AI tools or APIs (ChatGPT, Midjourney, Claude, custom-trained models, etc.).A scoring or voting system for judges or audience. judges give marks base on challenge.",
  "Rules_regulations": "1. Organizers will provide the challenge prompt or dataset at the start of the round( Text generation (story, article, or dialogue),Image generation (art, design, or logo),Data analysis or prediction tasks).2. All AI work must be done within the event time frame.3.Participants may use:Organizer-approved AI platforms (e.g., ChatGPT, DALL·E, Midjourney, local ML models).Publicly available datasets and tools (must be credited).4.No pre-generated submissions — all outputs must be created during the competition.5.Teams may enhance AI outputs with light editing, but the core work must be AI-generated.6.Prompt engineering is part of the challenge — participants must submit their final prompt(s) alongside results.Typically 30–60 minutes per challenge (varies by event).The final AI-generated output (text, image, code, etc.).A short explanation (1–2 minutes) of your prompt design or model setup.A player who use submitting work created before the event and Using AI platforms or tools not approved by organizers and Copying or passing off another team’s AI output as your own also Offensive or policy-violating content in submissions.Creativity & Originality — +20 point (novel prompt ideas, unexpected outputs)Relevance & Accuracy — +10 point (meets challenge requirements)Technical Skill — +10 point (prompt engineering, model configuration, workflow)Presentation — +20 point (clarity of explanation and final delivery)",
  "photo_path": "https://demo.bravisthemes.com/festiva/wp-content/uploads/2024/08/author-3.jpg",
  "Name": "Anil Gogari",
  "Designation": "AI/ML",
  "event_image1":"https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451285/ymasa1xfb6ljm4sciyqm.png",
  "event_image2": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451283/qwhde0fisb6wm3odppky.webp",
  "Location": "Chaprabhatha"
},{
  "Event_id": 5,
  "Event_name": "Teach Trivia Titan",
  "Event_type": "IT",
  "Start_time": "1:00PM",
  "End_time": "5:00PM",
  "Date": "19/12/2025",
  "Description": "Teach Trivia Titan sounds like a learning-meets-gaming experience , a challenge or platform where trivia questions are used not just for fun, but also for teaching or reinforcing knowledge.In the event-tech context you’ve been building with API Mashup, Debug Me, Design Dash, Rules & Regulations, and AI Battle, this could be another interactive module aimed at education through competition.Teach Trivia Titan is a gamified learning activity where participants answer trivia questions to gain points,level up, and earn the title of “Titan.” The focus is on knowledge building, engagement, and friendly competition, making it ideal for workshops, training sessions, or tech events.",
  "How_it_works":"1.Topic Selection – Organizers choose question categories (e.g., tech, event theme, history, pop culture).2.Question Delivery – Questions appear via the event app, big screen, or online platform.3.Interactive Features – Timed responses, hints, and lifelines to keep players engaged.4.Scoring and Leaderboard – Points for correct answers, with streak bonuses for consistent performance.5.Teaching Component – After each question, the correct answer is explained, adding an educational layer.",
  "Skills_developed": " 1.Concept recall and application.2.Communication and peer teaching.3.Public speaking and critical thinking.4.Cross-topic tech knowledge",
  "GamePlay": "1.Join the Game.2.Players log in or join via event app/code.3.Answer Questions.4.Multiple-choice, true/false, or short-answer formats.5.Time limits per question for extra challenge.6.Learn the Facts.7.After each question, the correct answer is revealed with a short explanation or fun fact.8.Score & Rank.9.Points for correct answers, bonus for speed and streaks.10.Declare the Titan.11The highest scorer at the end is crowned the 'Trivia Titan.'",
  "How_to_play": "Completer can participant either solo player or 2 - 3 people. Participants have Flexible — can be a single 15–30 minute round or multiple rounds across the event. We have provide A trivia question bank (can be tech-themed, event-specific, or general knowledge).Quiz delivery platform (event app, Kahoot, Slido, or on-stage host).Scoring system and leaderboard.. judges give marks base on challenge.",
  "Rules_regulations": "1.The quiz will be divided into multiple rounds, such as:a).Rapid Fire – Quick single-answer questions.b)Multiple Choice – Four options, one correct answer.c)Picture/Audio Round – Identify images or sound clips.d)Special Themed Round – Questions based on the event theme.e)The quizmaster will read out each question once; no repeats unless explicitly stated.f)Teams must submit answers within the given time per question or round.g)No internet searches, external devices, or AI tools are allowed.h)In case of a tie, a sudden death round will determine the winner.Each round has a fixed time per question (e.g., 20–30 seconds).Teams must record answers clearly on provided sheets or submit them digitally (as instructed).Player who will not followes rules will disqulify.",
  "photo_path": "https://demo.bravisthemes.com/festiva/wp-content/uploads/2024/08/about-us-author-3.jpg",
  "Name": "Ashvin Bodivala",
  "Designation": "PHP developer",
  "event_image1":"https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451285/wapm3s9abqs1mzzfyyw6.png",
  "event_image2": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451283/jksqjczq0xkifrcfjc2e.png",
  "Location": "Chaprabhatha"
},
{
  "Event_id": 6,
  "Event_name": "Code Karaoke",
  "Event_type": "IT",
  "Start_time": "1:00PM",
  "End_time": "5:00PM",
  "Date": "19/12/2025",
  "Description": "Code Karaoke is a playful, tech-themed activity where participants “perform” code in front of an audience — either by live coding, explaining code dramatically, or reading code aloud as if it were a song or performance script.In your event-tech context, it would be an interactive entertainment segment that mixes programming culture with the fun, competitive spirit of karaoke.Code Karaoke is a live event activity where participants present code in an entertaining way — through dramatic narration singing,humorous commentary, or creative reinterpretation. The aim is to celebrate coding culture, break the ice, and make technical content more accessible and fun.",
  "How_it_works":"1.Code Selection – Participants choose a snippet of code (famous algorithms, funny scripts, or even buggy code).2.Performance Style – Options could include:(Singing the code to a karaoke tune.Acting it out with gestures and voices.Reading it in a dramatic or comedic style).3. Audience Engagement – Viewers vote for the funniest, most creative, or most impressive performance.4.Optional Twist – Use a “Debug Me” round where the performer must fix a bug live while still in performance mode.",
  "Skills_developed": " 1.Real-time problem-solving.2.Verbal reasoning and explanation.3.Technical communication.4.Debugging under pressure",
  "GamePlay": "1.Select the Code.2.Choose from provided snippets or submit your own.3.Choose Your Style.4.Sing it to the tune of a known song.5.Perform it as a dramatic monologue.6.Act it out with exaggerated gestures.7.Perform for the Audience.8.Deliver the code with flair, energy, and accuracy.9.Audience or Judges Score Based on entertainment,creativity, and clarity.10.Judging Criteria11.Creativity – Original performance style and concept.12.Technical Accuracy – Code is delivered correctly.13.Stage Presence – Confidence and audience engagement.14.Entertainment Value – How much the performance makes people laugh, cheer, or clap.",
  "How_to_play": "Completer can participant either solo player or 2 - 3 people. Participants have 2 - 5 minute. We have provide A library of preselected code snippets (funny, classic, or intentionally buggy).Option for participants to bring their own code. Microphones, stage space, and optional background music/karaoke tracks. judges give marks base on challenge.",
  "Rules_regulations": "1.Organizers will provide a random code snippet (or participants may bring their own, subject to approval).2.Each participant/team has a short preparation time (e.g., 3–5 minutes) before performing.3.During the performance, participants must:Explain what the code does.Add their own creative twist — humor, analogies, storytelling, or dramatization.4.No use of slides or screen-sharing unless provided by organizers.5.Performances must stay within the given time limit (usually 2–4 minutes).6.Content must remain family-friendly and respectful.Preparation Time: 3–5 minutes after receiving code.Performance Time: 2–4 minutes per participant/team.People who will not follow the room Using inappropriate or offensive language.Not attempting to explain the code.Exceeding the time limit significantly.Judge's point show Technical Accuracy — +2o point (Correctly explaining what the code does).Clarity — +10 point (Making the explanation easy to follow).Creativity — +10 point (Original delivery, humor, storytelling).Engagement — +10 point(Audience involvement and energy)",
  "photo_path": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755005056/lxtzzcl6loi15wwbvhzm.png",
  "Name": "Harshit Gogil",
  "Designation": "Table Tennis",
  "event_image1":"https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451286/qoytybnwbypomhgpls2z.png",
  "event_image2": "https://res.cloudinary.com/dmmscwhqy/image/upload/v1755451286/vvaifteottwhatiuy9g2.gif",
  "Location": "Chaprabhatha"
}

]
